**复习：**在前面我们已经学习了Pandas基础，第二章我们开始进入数据分析的业务部分，在第二章第一节的内容中，我们学习了**数据的清洗**，这一部分十分重要，只有数据变得相对干净，我们之后对数据的分析才可以更有力。而这一节，我们要做的是数据重构，数据重构依旧属于数据理解（准备）的范围。

#### 开始之前，导入numpy、pandas包和数据

In [1]:
# 导入基本库
import numpy as np
import pandas as pd

In [2]:
# 载入上一个任务人保存的文件中:result.csv，并查看这个文件
df = pd.read_csv("result.csv")
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 2 第二章：数据重构

## 第一部分：数据聚合与运算

### 2.6 数据运用

#### 2.6.1 任务一：通过教材《Python for Data Analysis》P303、Google or anything来学习了解GroupBy机制

In [10]:
sex_graped = df.groupby('Sex').count()
sex_graped

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,,
female,314,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,577,453,577,577,577,577,107,577

#### 2.4.2：任务二：计算泰坦尼克号男性与女性的平均票价

In [12]:
# 写入代码
sex_graped = df.groupby('Sex')
sex_graped['Fare'].mean()

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [14]:
list(sex_graped)[0] #显示所有女性值

('female',
      Unnamed: 0  PassengerId  Survived  Pclass  \
 1             1            2         1       1
 2             2            3         1       3
 3             3            4         1       1
 8             8            9         1       3
 9             9           10         1       2
 ..          ...          ...       ...     ...
 880         441          881         1       2
 882         443          883         0       3
 885         446          886         0       3
 887         448          888         1       1
 888         449          889         0       3

                                                   Name     Sex   Age  SibSp  \
 1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0    1.0
 2                               Heikkinen, Miss. Laina  female  26.0    0.0
 3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0    1.0
 8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0    0.0
 9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0    1.0
 ..                                                 ...     ...   ...    ...
 880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0    0.0
 882                       Dahlberg, Miss. Gerda Ulrika  female  22.0    0.0
 885               Rice, Mrs. William (Margaret Norton)  female  39.0    0.0
 887                       Graham, Miss. Margaret Edith  female  19.0    0.0
 888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN    1.0

      Parch            Ticket     Fare Cabin Embarked
 1      0.0          PC 17599  71.2833   C85        C
 2      0.0  STON/O2. 3101282   7.9250   NaN        S
 3      0.0            113803  53.1000  C123        S
 8      2.0            347742  11.1333   NaN        S
 9      0.0            237736  30.0708   NaN        C
 ..     ...               ...      ...   ...      ...
 880    1.0            230433  26.0000   NaN        S
 882    0.0              7552  10.5167   NaN        S
 885    5.0            382652  29.1250   NaN        Q
 887    0.0            112053  30.0000   B42        S
 888    2.0        W./C. 6607  23.4500   NaN        S

 [314 rows x 13 columns])

In [15]:
sex_graped.describe() # 可以得到各个数据的数据个数，平均值，标准差，最大最小值等

       Unnamed: 0                                                            \
            count        mean         std  min    25%    50%     75%    max
Sex
female      314.0  227.305732  132.683758  1.0  109.5  236.0  340.75  449.0
male        577.0  219.571924  126.605257  0.0  112.0  219.0  330.00  451.0

       PassengerId              ... Parch        Fare                        \
             count        mean  ...   75%  max  count       mean        std
Sex                             ...
female       314.0  431.028662  ...   1.0  6.0  314.0  44.479818  57.997698
male         577.0  454.147314  ...   0.0  5.0  577.0  25.523893  43.138263


         min        25%   50%    75%       max
Sex
female  6.75  12.071875  23.0  55.00  512.3292
male    0.00   7.895800  10.5  26.55  512.3292

[2 rows x 64 columns]

In [16]:
sex_graped['Age'].describe()

        count       mean        std   min   25%   50%   75%   max
Sex
female  261.0  27.915709  14.110146  0.75  18.0  27.0  37.0  63.0
male    453.0  30.726645  14.678201  0.42  21.0  29.0  39.0  80.0

在了解GroupBy机制之后，运用这个机制完成一系列的操作，来达到我们的目的。

下面通过几个任务来熟悉GroupBy机制。

#### 2.4.3：任务三：统计泰坦尼克号中男女的存活人数

In [18]:
# 写入代码
sex_graped['Survived'].count()

Sex
female    314
male      577
Name: Survived, dtype: int64

In [35]:
sex_graped['Survived'].sum()

Sex
female    233
male      109
Name: Survived, dtype: int64

#### 2.4.4：任务四：计算客舱不同等级的存活人数

开始还以为没有等级呢，自己创造了一个分级，哈哈哈

In [27]:
df['level'] = df['Cabin'].str.extract('([A-Z]+)\d')
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,level
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S,NaN
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S,C
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S,NaN

In [30]:
# 写入代码
cabin_grouped = df.groupby(['level'])
cabin_grouped['Survived'].sum()

level
A     7
B    35
C    35
D    23
E    25
F     7
G     2
Name: Survived, dtype: int64

其实有等级的是属性Pclass

In [28]:
df.groupby('Pclass')['Survived'].count()

Pclass
1    216
2    184
3    491
Name: Survived, dtype: int64

In [29]:
df.groupby('Pclass')['Survived'].sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

这里发现count和sum是有数据区别的，count只是数了每个等级有多少人，没有看有多少人幸存，所以应该使用sum

【**提示：**】表中的存活那一栏，可以发现如果还活着记为1，死亡记为0

【**思考**】从数据分析的角度，上面的统计结果可以得出那些结论

In [37]:
#思考心得 

# Sex
# female    44.479818
# male      25.523893
# Name: Fare, dtype: float64

# 不同性别存活率计算
# 女性 233/314=0.7420382165605095
# 男性 109/577=0.18890814558058924

# 客舱等级存活率计算
# 1等 136/216=0.6296296296296297
# 2等 87/184=0.47282608695652173
# 3等 119/491=0.24236252545824846

0.18890814558058924

从上面计算可以得到

女性买的平均票价比男性高

女性存活率比男性存活率高很多

客舱等级越高，存活率越高

【思考】从任务二到任务三中，这些运算可以通过agg()函数来同时计算。并且可以使用rename函数修改列名。你可以按照提示写出这个过程吗？

任务二：计算泰坦尼克号男性与女性的平均票价

任务三：统计泰坦尼克号中男女的存活人数

In [49]:
#思考心得
agg_df = df.groupby('Sex').agg({'Fare': 'mean','Survived':'sum'})
# agg_df.rename(columns={'Fare': 'mean_Fare','Survived':'sum_Survived'}, inplace=True)
agg_df

             Fare  Survived
Sex
female  44.479818       233
male    25.523893       109

#### 2.4.5：任务五：统计在不同等级的票中的不同年龄的船票花费的平均值

In [48]:
# 写入代码
df.groupby(['Pclass','Age'])['Fare'].mean().head()

Pclass  Age
1       0.92     151.5500
        2.00     151.5500
        4.00      81.8583
        11.00    120.0000
        14.00    120.0000
Name: Fare, dtype: float64

#### 2.4.6：任务六：将任务二和任务三的数据合并，并保存到sex_fare_survived.csv

In [50]:
# 写入代码
agg_df.to_csv('sex_fare_survived.csv')

#### 2.4.7：任务七：得出不同年龄的总的存活人数，然后找出存活人数最多的年龄段，最后计算存活人数最高的存活率（存活人数/总人数）

In [3]:
# 写入代码
age_survived = df.groupby('Age')['Survived'].sum()
age_survived

Age
0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    0
70.50    0
71.00    0
74.00    0
80.00    1
Name: Survived, Length: 88, dtype: int64

In [4]:
type(age_survived)

pandas.core.series.Series

In [5]:
# 写入代码
max1 = max(age_survived)

In [6]:
age_survived[age_survived.values == max1]

Age
24.0    15
Name: Survived, dtype: int64

In [9]:
# 写入代码
sum(df['Survived'])

342

In [10]:
# 写入代码
max1/sum(df['Survived'])

0.043859649122807015